; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v7 ?v6)
             (pred_12 ?v11 ?v1)
             (pred_2 ?v7 ?v1)
             (pred_8 ?v8 ?v7 )
	     (pred_4 ?v7)
             (pred_1 ?v5)
             (pred_3 ?v11)
             (pred_6 ?v1)
             (pred_10 ?v7)
             (pred_7 ?v11)
             (pred_11 ?v7)
             (pred_9 ))



(:action op_2
:parameters (?v9 ?v13 ?v3 ?v10)
:precondition (and (pred_1 ?v9) (pred_1 ?v13) (pred_3 ?v3) (pred_6 ?v10)
          (pred_5 ?v9 ?v13) (pred_12 ?v3 ?v10)
                   (pred_2 ?v13 ?v10) (pred_4 ?v9) 
                   (pred_10 ?v13) (pred_7 ?v3))
:effect (and  (pred_11 ?v13) (not (pred_10 ?v13))))


(:action op_1
:parameters (?v9 ?v12)
:precondition (and (pred_1 ?v9) (pred_1 ?v12)
               (pred_4 ?v9) (pred_5 ?v9 ?v12) (pred_11 ?v12))
:effect (and (pred_4 ?v12) (not (pred_4 ?v9))))

(:action op_4
:parameters (?v9 ?v3)
:precondition (and (pred_1 ?v9) (pred_3 ?v3) 
                  (pred_4 ?v9) (pred_8 ?v3 ?v9) (pred_9 ))
:effect (and (pred_7 ?v3)
   (not (pred_8 ?v3 ?v9)) (not (pred_9 ))))


(:action op_3
:parameters (?v9 ?v2 ?v4)
:precondition (and (pred_1 ?v9) (pred_3 ?v2) (pred_3 ?v4)
                  (pred_4 ?v9) (pred_7 ?v4) (pred_8 ?v2 ?v9))
:effect (and (pred_7 ?v2) (pred_8 ?v4 ?v9)
        (not (pred_7 ?v4)) (not (pred_8 ?v2 ?v9))))

(:action op_5
:parameters (?v9 ?v3)
:precondition (and (pred_1 ?v9) (pred_3 ?v3) 
                  (pred_4 ?v9) (pred_7 ?v3))
:effect (and (pred_9 ) (pred_8 ?v3 ?v9) (not (pred_7 ?v3)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_07 obj_12 obj_08 obj_06 obj_01 obj_09 obj_11 obj_05 obj_03
    obj_13 obj_04
    obj_02 obj_10
    )

    (:init
       (pred_9)

       (pred_1 obj_07)
       (pred_1 obj_12)
       (pred_1 obj_08)
       (pred_1 obj_06)
       (pred_1 obj_01)
       (pred_1 obj_09)
       (pred_1 obj_11)
       (pred_1 obj_05)
       (pred_1 obj_03)
       (pred_6 obj_13)
       (pred_6 obj_04)
       (pred_3 obj_02)
       (pred_3 obj_10)

       (pred_5 obj_07 obj_06)
       (pred_5 obj_07 obj_12)
       (pred_5 obj_12 obj_01)
       (pred_5 obj_12 obj_08)
       (pred_5 obj_12 obj_07)
       (pred_5 obj_08 obj_09)
       (pred_5 obj_08 obj_12)
       (pred_5 obj_06 obj_11)
       (pred_5 obj_06 obj_01)
       (pred_5 obj_06 obj_07)
       (pred_5 obj_01 obj_05)
       (pred_5 obj_01 obj_09)
       (pred_5 obj_01 obj_12)
       (pred_5 obj_01 obj_06)
       (pred_5 obj_09 obj_03)
       (pred_5 obj_09 obj_08)
       (pred_5 obj_09 obj_01)
       (pred_5 obj_11 obj_05)
       (pred_5 obj_11 obj_06)
       (pred_5 obj_05 obj_03)
       (pred_5 obj_05 obj_01)
       (pred_5 obj_05 obj_11)
       (pred_5 obj_03 obj_09)
       (pred_5 obj_03 obj_05)
       (pred_10 obj_11)
       (pred_10 obj_07)
       (pred_2  obj_11 obj_13)
       (pred_2  obj_07 obj_04)
       (pred_11 obj_12)
       (pred_11 obj_08)
       (pred_11 obj_06)
       (pred_11 obj_01)
       (pred_11 obj_09)
       (pred_11 obj_05)
       (pred_11 obj_03)

       (pred_12  obj_02 obj_13)
       (pred_12  obj_10 obj_04)
       (pred_8 obj_02 obj_08)
       (pred_8 obj_10 obj_08)
       (pred_4 obj_05)
    )

    (:goal (and
       (pred_8 obj_02 obj_12)
    ))
(:constraints
  (always (not (pred_4 obj_01)))
)
)

; plan
1. (op_1 obj_05 obj_03)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_03)
   goals met: 0 of 1
2. (op_1 obj_03 obj_09)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_09)
   goals met: 0 of 1
3. (op_1 obj_09 obj_08)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_08)
   goals met: 0 of 1
4. (op_4 obj_08 obj_02)
   deleted: (pred_8 obj_02 obj_08) (pred_9)
   added: (pred_7 obj_02)
   goals met: 0 of 1
5. (op_1 obj_08 obj_12)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_12)
   goals met: 0 of 1
6. (op_5 obj_12 obj_02)
   deleted: (pred_7 obj_02)
   added: (pred_9) (pred_8 obj_02 obj_12)
   goals met: 1 of 1
